app/controllers/sessions_controller.rb

	def destroy
		#complete this method
		User.find(session[:user_id]).destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]