app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "federico@test.com"], ["LIMIT", 1]]
---
	def create
		#complete this method
		@user = User.where(email: params[:session][:email]).first