app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Franciscos"], ["password", "cacapupu1"], ["updated_at", "2019-04-20 04:25:43.535325"], ["id", 1]]
---
  def update
    #complete this method
    respond_to do |format|
      if @user.update(user_params)